Revit 2027 API
StructuralAsset.ConcreteShearStrengthReduction Property
 The shear strength reduction of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ConcreteShearStrengthReduction { get; set; }
Public Property ConcreteShearStrengthReduction As Double
	Get
	Set
public:
property double ConcreteShearStrengthReduction {
	double get ();
	void set (double value);
}
member ConcreteShearStrengthReduction : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be concrete to set this property.
Remarks
 Applies to concrete-based structural assets.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace